app/views/sessions/new.html.erb

<%= form_for @user, url: login_path, method: :post do f %>
  <%= f.collection_select :name, User.all, :name, :name %>
---
SELECT "users".* FROM "users"