app/views/meals/show.html.erb

SELECT "foods".* FROM "foods" INNER JOIN "foodlogs" ON "foods"."id" = "foodlogs"."food_id" WHERE "foodlogs"."meal_id" = $1  [["meal_id", 1]]
---
<ul>
    Foods: <%= @meal.foods.each do |food|%>

SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = $1 AND "meals"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 5], ["LIMIT", 1]]
SELECT 1 AS one FROM "meals" WHERE "meals"."user_id" = $1 AND "meals"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
---
<br>
<% if  current_user.meals.include?(@meal) %>