app/views/foods/show.html.erb


<% if  current_user.foods.include?(@food) %>
---
SELECT 1 AS one FROM "foods" WHERE "foods"."user_id" = $1 AND "foods"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]