app/controllers/foods_controller.rb

  def create
    food = current_user.foods.build(food_params)
    if food.save
---
INSERT INTO "foods" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Banana"], ["user_id", 1], ["created_at", "2020-07-24 01:38:49.903905"], ["updated_at", "2020-07-24 01:38:49.903905"]]

  def show
    @food = Food.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def edit
    @food = current_user.foods.find_by_id(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1 AND "foods"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]

  def update
    food = current_user.foods.find(params[:id])
    food.update(food_params)
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1 AND "foods"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
UPDATE "foods" SET "proteins" = $1, "updated_at" = $2 WHERE "foods"."id" = $3  [["proteins", 1], ["updated_at", "2020-07-24 00:28:40.001756"], ["id", 3]]

  def destroy
    food = current_user.foods.find_by_id(params[:id])
    food.destroy
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1 AND "foods"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 2]]

  def set_foods!
    # @food = Food.find(params[:id])
    @food = current_user.foods.find_by_id(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1 AND "foods"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]