app/controllers/meals_controller.rb

INSERT INTO "meals" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Meal 01"], ["user_id", 1], ["created_at", "2020-07-23 22:08:58.532161"], ["updated_at", "2020-07-23 22:08:58.532161"]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def create
    # @food = Food.new(food_params) #finish this nest
    meal = current_user.meals.build(meal_params)
    if meal.save
      redirect_to meal_path(meal)
    else
      @food = Food.find_by_id(params[:food_id])

SELECT "meals".* FROM "meals"
---
  def index
      @meals = Meal.all

SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = $1 AND "meals"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 5], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" INNER JOIN "foodlogs" ON "foods"."id" = "foodlogs"."food_id" WHERE "foodlogs"."meal_id" = $1  [["meal_id", 1]]
SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = $1 AND "meals"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
---
  def show
    if @meal = current_user.meals.find_by_id(params[:id])
      @food = @meal.foods.build(user_id: current_user.id)
    else
      @meal = Meal.find_by_id(params[:id])

SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = $1 AND "meals"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
SELECT "foodlogs".* FROM "foodlogs" INNER JOIN "meals" ON "foodlogs"."meal_id" = "meals"."id" WHERE "meals"."user_id" = $1 AND "foodlogs"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @meal = current_user.meals.find_by_id(params[:id])

    @foodlogs = current_user.foodlogs.find_by_id(params[:id])

SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = $1 AND "meals"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "meals" SET "name" = $1, "updated_at" = $2 WHERE "meals"."id" = $3  [["name", "Meal 05"], ["updated_at", "2020-07-24 15:38:29.144469"], ["id", 5]]
---
  def update
    meal = current_user.meals.find(params[:id])
    meal.update(meal_params)

SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "meals" WHERE "meals"."id" = $1  [["id", 2]]
---
  def destroy
    meal = current_user.meals.find_by_id(params[:id])
    meal.destroy

SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_meals!
    @meal = Meal.find(params[:id])