app/controllers/meals_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    #nested route
    if params[:user_id] && @user = User.find_by_id(params[:user_id])