app/controllers/sessions_controller.rb

    def omniauth #log in with omniauth
        user = User.create_from_omniauth
---
INSERT INTO "users" ("name", "password_digest", "email", "created_at", "updated_at", "uid", "provider") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def create #log in manually
        user = User.find_by_name(params[:user][:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "qwer"], ["LIMIT", 1]]