app/controllers/users_controller.rb

    def create
        if user = User.create(user_params)
---
INSERT INTO "users" ("name", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"