app/controllers/users_controller.rb

    def show
        @user = User.find_by_id(params[:id])
        @meals = current_user.meals.includes(foodlogs:[:foods])
---
SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = $1  [["user_id", 7]]

    def edit
        @user = User.find_by_id(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def update
        current_user.update(user_params)
---
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Randy"], ["updated_at", "2020-07-24 02:43:26.738733"], ["id", 7]]

    def destroy
		# current_user.meals.try.delete
		# current_user.foodlogs.try.delete
		current_user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]