app/models/user.rb

    def self.create_from_omniauth(auth)
        user = User.find_or_create_by(uid: auth['uid'], provider: auth['provider']) do |u|
---
INSERT INTO "users" ("name", "password_digest", "email", "created_at", "updated_at", "uid", "provider") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."uid" = $1 AND "users"."provider" = $2 LIMIT $3  [["uid", "104405097401751336968"], ["provider", "google_oauth2"], ["LIMIT", 1]]